Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཆེ་བར་མི་བགྱིད། ཆུང་བར་མི་བགྱིད།
en: It does not enhance the sense fields, the sensory elements, or the links of dependent origination, nor does it diminish them.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཆེ་བར་མི་བགྱིད། ཆུང་བར་མི་བགྱིད།
en: It does not enhance the perfection of generosity, nor does it diminish it.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཆེ་བར་མི་བགྱིད།
en: It does not enhance the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, or the perfection of meditative concentration, nor does it diminish them.

source: ཆུང་བར་མི་བགྱིད། ནང་སྟོང་པ་ཉིད་ཆེ་བར་མི་བགྱིད།
en: It does not enhance the emptiness of internal phenomena, nor does it diminish it.

source: ཆུང་བར་མི་བགྱིད། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཆེ་བར་མི་བགྱིད། ཆུང་བར་མི་བགྱིད།
en: It does not enhance the emptiness of external phenomena, the emptiness of external and internal phenomena, or [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, nor does it diminish them.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཆེ་བར་མི་བགྱིད། ཆུང་བར་མི་བགྱིད། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: It does not enhance the thirty-seven factors conducive to enlightenment, nor does it diminish them.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཆེ་བར་མི་བགྱིད། ཆུང་བར་མི་བགྱིད། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: It does not enhance the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, or wishlessness, nor does it diminish them.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཆེ་བར་མི་བགྱིད། ཆུང་བར་མི་བགྱིད། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཆེ་བར་མི་བགྱིད།
en: It does not enhance the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas, nor does it diminish them.

source: ཆུང་བར་མི་བགྱིད། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཆེ་བར་མི་བགྱིད།
en: It does not enhance the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment, nor does it diminish them.

source: ཆུང་བར་མི་བགྱིད། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཆེ་བར་མི་བགྱིད། ཆུང་བར་མི་བགྱིད།
en: It does not enhance knowledge of the path, enlightenment, the buddhas, or the attributes of the buddhas, nor does it diminish them. “

source: གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཟུགས་འདུ་བར་མི་བགྱིད། ཡངས་པར་མི་བགྱིད།
en: Moreover, the perfection of wisdom does not absorb physical forms, nor does it diffuse them.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་འདུ་བར་མི་བགྱིད། ཡངས་པར་མི་བགྱིད།
en: It does not absorb feelings, perceptions, formative predispositions, or consciousness, nor does it diffuse them.

source: བྱང་ཆུབ་དང་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་འདུ་བར་མི་བགྱིད། ཡངས་པར་མི་བགྱིད།
en: It does not absorb [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, nor does it diffuse them. “

source: གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཟུགས་ཚད་མཆིས་པར་མི་བགྱིད། ཚད་མ་མཆིས་པར་མི་བགྱིད།
en: Moreover, the perfection of wisdom does not measure physical forms, nor does it not measure them.

source: བྱང་ཆུབ་དང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་ཚད་མཆིས་པར་མི་བགྱིད། ཚད་མ་མཆིས་པར་མི་བགྱིད།
en: It does not measure [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, nor does it not measure them. “

source: གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། གཟུགས་རྒྱ་ཆེན་པོར་མི་བགྱིད། རྒྱ་ཆུང་ངུར་མི་བགྱིད།
en: Moreover, the perfection of wisdom does not enlarge physical forms, nor does it contract them.

source: བྱང་ཆུབ་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་རྒྱ་ཆེན་པོར་མི་བགྱིད། རྒྱ་ཆུང་ངུར་མི་བགྱིད།
en: It does not enlarge [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, nor does it contract them. “

source: གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། གཟུགས་མཐུ་དང་ལྡན་པར་མི་བགྱིད།
en: Moreover, the perfection of wisdom does not strengthen physical forms, nor does it weaken them.

source: མཐུ་མ་མཆིས་པར་མི་བགྱིད།
en: Similarly, it does not strengthen feelings, perceptions, formative predispositions, or consciousness, nor does it weaken them.

source: བྱང་ཆུབ་དང་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མཐུ་དང་ལྡན་པར་མི་བགྱིད། མཐུ་མ་མཆིས་པར་མི་བགྱིད་དེ། བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ན་འདི་ལྟ་སྟེ།
en: It does not strengthen [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, nor does it weaken them. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཆེན་པོའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྟེན་ནས། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྟེན་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཟུགས་ཆེ་བར་མི་བྱེད། ཆུང་པད་མི་བྱེད་དོ། །བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་ཆེ་བར་མི་བྱེད། ཆུང་བར་མི་བྱེད་དོ།
en: Blessed Lord, this formulation explains how this perfection of wisdom is the great perfection, possessed by bodhisattva great beings. “

source: །གཟུགས་མཐུ་དང་ལྡན་པའི་བར་དུ་མི་བྱེད་དེ། མཐུ་མེད་པར་མི་བྱེད་དོ། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མཐུ་དང་ལྡན་པར་མི་བྱེད། མཐུ་མེད་པར་མི་བྱེད་དོ་ཞེས་བགྱི་བར་འདུ་ཤེས་སུ་གྱུར་ན། བཅོམ་ལྡན་འདས་དེ་ལྟར་འདུ་ཤེས་སུ་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་ལགས་སོ།
en: Blessed Lord, if bodhisattva great beings who have newly entered the [great] vehicle, relying on the perfection of wisdom, and relying on the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity, perceive that the perfection of wisdom neither enhances nor diminishes physical forms, and that it neither enhances nor diminishes [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, or that it [neither absorbs nor diffuses, neither measures nor does not measure, neither enlarges nor contracts, and] neither strengthens nor weakens physical forms, and that it neither strengthens nor weakens [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, in that case, Blessed Lord, those bodhisattva great beings who perceive in such a way do not practice the perfection of wisdom.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། གང་གཟུགས་ཆེ་བར་བགྱིད་པའམ། ཆུང་བར་བགྱིད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མཐུན་པའི་འབྲས་བུ་མ་ལགས་སོ།
en: If one were to ask why, it is because anything that enhances or diminishes physical forms is not an outcome compatible with the perfection of wisdom.

source: །བྱང་ཆུབ་དང་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་ཆེ་བར་བགྱིད་པའམ། ཆུང་བར་བགྱིད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། མཐུན་པའི་འབྲས་བུ་མ་ལགས་སོ།
en: Anything that enhances or diminishes [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, is not an outcome compatible with the perfection of wisdom.

source: །གང་གཟུགས་མཐུ་དང་ལྡན་པའི་བར་དུ་བགྱིད་པའམ། མཐུ་མ་མཆིས་པར་བགྱིད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མཐུན་པའི་འབྲས་བུ་མ་ལགས་སོ།
en: Anything that [absorbs or diffuses, measures or does not measure, enlarges or contracts, or] strengthens or weakens physical forms is not an outcome compatible with the perfection of wisdom.

source: །གང་བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མཐུ་དང་ལྡན་པའམ། མཐུ་མ་མཆིས་པར་བགྱིད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མཐུན་པའི་འབྲས་བུ་མ་ལགས་ཏེ།
en: Anything that strengthens or weakens [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, is not an outcome compatible with the perfection of wisdom. “

source: བཅོམ་ལྡན་འདས་གང་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ཆེ་བར་བགྱིད་པ་འམ། ཆུང་བར་བགྱིད་པའམ། བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་ཆེ་བར་བགྱིད་པའམ། ཆུང་བར་བགྱིད་པའམ། གང་གཟུགས་མཐུ་དང་ལྡན་བའི་བར་དུ་བགྱིད་པའམ། མཐུ་མ་མཆིས་པར་བགྱིད་པའམ། བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མཐུ་དང་ལྡན་པའི་བར་དུ་བགྱིད་པའམ། མཐུ་མ་མཆིས་པའི་བར་དུ་བགྱིད་པ་དེ་ནི་དེའི་དམིགས་པ་ཆེན་པོར་འགྱུར་རོ།
en: Blessed Lord, when they practice the perfection of wisdom in that manner, anything that enhances or diminishes physical forms, anything that enhances or diminishes [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, or anything that [absorbs or diffuses, measures or does not measure, enlarges or contracts, or] strengthens or weakens physical forms, and anything that [absorbs or diffuses, measures or does not measure, enlarges or contracts, or] strengthens or weakens [all those other phenomena, attributes, and attainments], up to and including enlightenment, the buddhas, and the attributes of the buddhas, becomes their great apprehending.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དམིགས་པའི་འདུ་ཤེས་ཅན་ལ་བྱང་ཆུབ་ཅེས་བགྱི་བ་མ་མཆིས་ཏེ།
en: If you ask why, it is because there is said to be no enlightenment for those with apprehending perception. “

source: དེ་ནི་འདི་ལྟར་སེམས་ཅན་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྐྱེ་བ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that beings are nonarising, you should see that the perfection of wisdom is nonarising.

source: །གཟུགས་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ།
en: Owing to the fact that physical forms are nonarising, {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྐྱེ་བ་མ་མཆིས་པར་བལྟའོ།
en: II-III: 148} you should see that the perfection of wisdom is nonarising.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྐྱེ་བ་མ་མཆིས་པ་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྐྱེ་བ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are nonarising, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are nonarising, you should see that the perfection of wisdom is nonarising. “

source: །སེམས་ཅན་རང་བཞིན་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རང་བཞིན་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that beings are without inherent existence, you should see that the perfection of wisdom is without inherent existence.

source: །གཟུགས་རང་བཞིན་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རང་བཞིན་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that physical forms are without inherent existence, you should see that the perfection of wisdom is without inherent existence.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རང་བཞིན་མ་མཆིས་པ་དང་། བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are without inherent existence, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are without inherent existence, you should see that the perfection of wisdom is without inherent existence. “

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་རང་བཞིན་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རང་བཞིན་མ་མཆིས་པར་བལྟའོ། །སེམས་ཅན་དངོས་པོ་མ་མཆིས་པའི་སླད་དུ།
en: Owing to the fact that beings are without entity, you should see that the perfection of wisdom is without entity.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དངོས་པོ་མ་མཆིས་པར་བལྟའོ། །གཟུགས་དངོས་པོ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དངོས་པོ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that physical forms are without entity, you should see that the perfection of wisdom is without entity.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དངོས་པོ་མ་མཆིས་པ་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་དངོས་པོ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་དུ་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are without entity, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are without entity, you should see that the perfection of wisdom is without entity. “

source: སེམས་ཅན་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་དུ་བལྟའོ།
en: Owing to the fact that beings are emptiness, you should see that the perfection of wisdom is emptiness.

source: །གཟུགས་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་དུ་བལྟའོ།
en: Owing to the fact that physical forms are emptiness, you should see that the perfection of wisdom is emptiness.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་པ་ཉིད་དུ་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are emptiness, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are emptiness, you should see that the perfection of wisdom is emptiness. “

source: །སེམས་ཅན་དབེན་པའི་སླད་དུ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པར་བལྟའོ།
en: Owing to the fact that beings are void, you should see that the perfection of wisdom is void.

source: །གཟུགས་དབེན་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པར་བལྟའོ།
en: Owing to the fact that physical forms are void, you should see that the perfection of wisdom is void.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དབེན་པ་དང་། བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་དབེན་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དབེན་པར་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are void, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are void, you should see that the perfection of wisdom is void. “

source: །སེམས་ཅན་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that beings are nonexistent, you should see that the perfection of wisdom is nonexistent.

source: །གཟུགས་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that physical forms are nonexistent, you should see that the perfection of wisdom is nonexistent.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མ་མཆིས་པ་དང་། བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are nonexistent, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are nonexistent, you should see that the perfection of wisdom is nonexistent. “

source: །སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་པར་བལྟའོ།
en: Owing to the fact that beings are inconceivable, you should see that the perfection of wisdom is inconceivable.

source: །གཟུགས་བསམ་གྱིས་མི་ཁྱབ་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་པར་བལྟའོ།
en: Owing to the fact that physical forms are inconceivable, you should see that the perfection of wisdom is inconceivable.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་བསམ་གྱིས་མི་ཁྱབ་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་པར་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are inconceivable, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are inconceivable, you should see that the perfection of wisdom is inconceivable. “

source: །སེམས་ཅན་རྣམ་པར་འཇིག་པ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་འཇིག་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that beings are indestructible, you should see that the perfection of wisdom is indestructible.

source: །གཟུགས་རྣམ་པར་འཇིག་པ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་འཇིག་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that physical forms are indestructible, you should see that the perfection of wisdom is indestructible.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་རྣམ་པར་འཇིག་པ་མ་མཆིས་པ་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་རྣམ་པར་འཇིག་པ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་འཇིག་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are indestructible, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are indestructible, you should see that the perfection of wisdom is indestructible. “

source: །སེམས་ཅན་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that beings do not attain consummate buddhahood, you should see that the perfection of wisdom does not attain consummate buddhahood.

source: །གཟུགས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that physical forms do not attain consummate buddhahood, you should see that the perfection of wisdom does not attain consummate buddhahood.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས་པ་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness do not attain consummate buddhahood, and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, do not attain consummate buddhahood, you should see that the perfection of wisdom does not attain consummate buddhahood. “

source: །སེམས་ཅན་གྱི་སྟོབས་ཡོངས་སུ་འགྲུབ་པ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྟོབས་ཡོངས་སུ་འགྲུབ་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that beings are not endowed with the consummate powers [of the tathāgatas], you should see that the perfection of wisdom is not endowed with the consummate powers [of the tathāgatas].

source: །གཟུགས་ཀྱི་སྟོབས་ཡོངས་སུ་འགྲུབ་པ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྟོབས་ཡོངས་སུ་འགྲུབ་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that physical forms are not endowed with the consummate powers [of the tathāgatas], you should see that the perfection of wisdom is not endowed with the consummate powers [of the tathāgatas].

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་སྟོབས་ཡོངས་སུ་འགྲུབ་པ་མ་མཆིས་པ་དང་། བྱང་ཆུབ་དང་སངས་རྒྱས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་གྱི་སྟོབས་ཡོངས་སུ་འགྲུབ་པ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྟོབས་ཡོངས་སུ་འགྲུབ་པ་མ་མཆིས་པར་བལྟའོ།
en: Owing to the fact that feelings, perceptions, formative predispositions, and consciousness are not endowed with the consummate powers [of the tathāgatas], and that [all those other phenomena, attributes, and attainments], up to and including enlightenment, buddhas, and the attributes of the buddhas, are not endowed with the consummate powers [of the tathāgatas], you should see that the perfection of wisdom is not endowed with the consummate powers [of the tathāgatas]. “

source: །བཅོམ་ལྡན་འདས་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཆེན་མོའོ།
en: This formulation explains, Blessed Lord, how this perfection of wisdom is the great perfection, possessed by bodhisattva great beings.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ཉི་ཤུ་ལྔ་བའོ།། །།
en: This completes the twenty-fifth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། །བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ། མོས་པར་འགྱུར་བ་དེ། གང་ནས་ཤི་འཕོས་ཏེ་འདིར་མཆིས་པ་ལགས།
en: Chapter 26: The Hells Then the venerable Śāradvatīputra asked the Blessed One, “Blessed Lord, where did those bodhisattva great beings who are resolute in this profound perfection of wisdom pass away before coming into this world?

source: །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ཇི་སྲིད་ཅིག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ལགས།
en: For how long have those noble sons or noble daughters embarked on unsurpassed, complete enlightenment?

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་བ་ལགས།
en: How many tathāgatas, arhats, completely awakened buddhas have they honored? {

source: གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་དོན་དང་ཚུལ་གྱིས་མོས་པར་འགྱུར་བ་དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནི་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ནས་སྤྱོད་པ་ལགས།
en: Ki.II-III: 149} Are they genuinely and methodically resolute in this profound perfection of wisdom? How long have they practiced the perfection of generosity?

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནི་ཡུན་རིང་པོ་ཇི་སྲིད་ཅིག་ནས་སྦྱང་པ་ལགས།
en: How long have they practiced the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚད་མེད་གྲངས་མེད་པ་བསྙེན་བཀུར་ནས་འདིར་འོངས་ཤིང་འདིར་སྐྱེས་པ་སྟེ།
en: Śāradvatīputra,” replied the Blessed One, “those bodhisattva great beings have come into this world, and have been reborn in this world, after venerating immeasurable, countless tathāgatas, arhats, completely awakened buddhas, throughout the world systems of the ten directions.
